@echo off
chcp 65001 >nul
cd /d "%~dp0"

echo ========================================
echo   Создание миграций базы данных
echo ========================================
echo.

python manage.py makemigrations

echo.
echo ========================================
echo   Применение миграций базы данных
echo ========================================
echo.


python manage.py migrate

echo.
echo ========================================
echo   Миграции применены успешно!
echo ========================================
echo.
pause
